{
    "version": "https://jsonfeed.org/version/1",
    "title": "PADDLE",
    "description": "",
    "home_page_url": "https://paddle-cluster.github.io",
    "feed_url": "https://paddle-cluster.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Thomas Hillman"
    },
    "items": [
        {
            "id": "https://paddle-cluster.github.io/drowning-in-forum-posts.html",
            "url": "https://paddle-cluster.github.io/drowning-in-forum-posts.html",
            "title": "Drowning in forum posts",
            "summary": "<p data-selectable-paragraph=\"\">This text by <a href=\"https://paddle-cluster.github.io/thomas-hillman.html\">Thomas Hillman</a> details a relatively simple way of scrapping and organizing data from online forums that do not provide API access without the need to code. Obviously, writing simple scripts using libraries like Beautiful Soup for Python is a more efficient way to work, but it requires a good amount of effort to learn the basics of programming. This effort is worth it in the end, but in the mean time it is good to have work arounds.</p>\n",
            "content_html": "<p >This text by <a href=\"https://paddle-cluster.github.io/thomas-hillman.html\">Thomas Hillman</a> details a relatively simple way of scrapping and organizing data from online forums that do not provide API access without the need to code. Obviously, writing simple scripts using libraries like Beautiful Soup for Python is a more efficient way to work, but it requires a good amount of effort to learn the basics of programming. This effort is worth it in the end, but in the mean time it is good to have work arounds.</p>\n\n<p id=\"da89\" >My training as a social scientist has focused on ethnographic methods and the use of detailed video ethnography has been the cornerstone of my research practice. But, like many social scientists in the last few years, my attention has turned more and more to online interactions between people and this has posed significant challenges. As many have lamented, the sheer volume of data that must be managed is in many ways incompatible with the detailed, situated approaches I am trained in. Finding ways to sort through enormous flows of interactions and make rigorous choices about which interactions to focus my detailed analysis on has proven to be both fascinating and frustrating. A case in point is my current work to understand informal learning in communities of amateur ‘citizen scientists’ who contribute to large science projects through their efforts online. One of the communities I am studying has had an active discussion forum for the past eight years and finding a way to manage 650,000 posts, many of which form detailed scientific discussions that take place over several months, has forced me to find new ways of working.</p>\n<h2 id=\"7d34\" class=\"jz ka cv v ba fh ib kb id kc kd ke kf kg kh ki kj\">Collecting the avalanche</h2>\n<p id=\"422d\" class=\"jm jn cv v ab b jo kk jq kl js km ju kn jw ko jy gk\" >650,000 posts means that just ‘browsing’ the forum site in an attempt to find something significant to focus on is not practical. Beyond which, while I have taken a more convenience oriented approach to sampling online activity in the past, I have more and more misgivings about this kind of ‘shot in the dark’ case selection that stands as one pole in the dichotomy of big and small data research on online activity. To take a more rigorous approach to sampling the data, I need to be able to represent it and cut it up in my own ways. This means I need to collect it in some sort of usable form.</p>\n<p id=\"e8a9\" class=\"jm jn cv v ab b jo jp jq jr js jt ju jv jw jx jy gk\" >I have worked with a number of different ways of scraping social media and web content, but for forums I find that the best tool is the <a href=\"http://webscraper.io/\" class=\"bw dl kp kq kr ks\" target=\"_blank\" rel=\"noopener nofollow\">http://webscraper.io</a> Chrome extension. Using webscraper I was able to build a tool that moved through all the threads and posts and collected the data to a <a href=\"http://couchdb.apache.org/\" class=\"bw dl kp kq kr ks\" target=\"_blank\" rel=\"noopener nofollow\">CouchDB</a> database that I could later export to a simple CSV file. Rather than store the raw html, I chose to scrape the text, hyperlinks, and images of each post as separate entities. This gave me plain text to work with and all the URLs referred to. I also collected the thread and post titles, poster, and timestamp. The resulting CSV file has a row for each post and the following columns:</p>\n<p id=\"2169\" class=\"jm jn cv v ab b jo jp jq jr js jt ju jv jw jx jy gk\" ><em class=\"kt\">pagination_forum&gt;thread&gt;pagination_thread&gt;user&gt;time&gt;text&gt;links&gt;images</em></p>\n<p id=\"c47e\" class=\"jm jn cv v ab b jo jp jq jr js jt ju jv jw jx jy gk\" >I then took this CSV file and used <a href=\"http://www.barebones.com/products/textwrangler/\" class=\"bw dl kp kq kr ks\" target=\"_blank\" rel=\"noopener nofollow\">TextWrangler</a>’s brilliant ‘Zap Gremlins’ function to clean up some strange artefacts that appeared because of changes in text encoding.</p>\n<h2 id=\"1e9c\" class=\"jz ka cv v ba fh ib kb id kc kd ke kf kg kh ki kj\">Re-threading the once threaded</h2>\n<p id=\"d2c9\" class=\"jm jn cv v ab b jo kk jq kl js km ju kn jw ko jy gk\" >One of the problems with scraping is that the order the scraper moves through a forum site may not follow the logical reading order for posts. This means that while I managed to collect all 650,000 posts into a series of spreadsheet files for each sub-forum, the order the posts appeared made threads totally unreadable. If I only wanted to perform descriptive statistical analysis on the posts this wouldn’t be a problem, but I want to analyse the discussions as interactions and so clearly they needed resorting.</p>\n<p id=\"87be\" class=\"jm jn cv v ab b jo jp jq jr js jt ju jv jw jx jy gk\" >I tried to import the CSV files into qualitative data analysis program <a href=\"http://www.maxqda.com/\" class=\"bw dl kp kq kr ks\" target=\"_blank\" rel=\"noopener nofollow\">MaxQDA</a> and use it to sort out the posts, but quickly realised that what I needed was to see each thread as separate document organised by sub-forum in the QDA database and not each post organised by thread. This meant that I needed to reconstitute the threads within the spreadsheet files and split each thread off as separate CSV files before importing them into MaxQDA. Fortunately, after a great deal of trying I managed to get Excel to perform the task:</p>\n<ol class=\"\">\n<li id=\"36b8\" class=\"jm jn cv v ab b jo jp jq jr js jt ju jv jw jx jy ku kv kw\" >I performed a custom sort on each spreadsheet. Level 1 of the sort was the thread title (this groups all the posts for a thread), and level 2 was the timestamp (this sorted the posts within each thread).</li>\n<li id=\"398e\" class=\"jm jn cv v ab b jo kx jq ky js kz ju la jw lb jy ku kv kw\" >I then used pivot tables to filter the data by thread and make each thread its own sheet.</li>\n<li id=\"c01a\" class=\"jm jn cv v ab b jo kx jq ky js kz ju la jw lb jy ku kv kw\" >Then I used <a href=\"http://www.accountingweb.co.uk/anyanswers/macro-exporting-50-worksheets-csv-one-pass\" class=\"bw dl kp kq kr ks\" target=\"_blank\" rel=\"noopener nofollow\">this VBA script</a> to automatically save each sheet as a new CSV file (VBA scripts only work easily on Windows versions of Excel so I was forced to fire-up the old virtual machine on my Mac to make this work).</li>\n</ol>\n<p id=\"9955\" class=\"jm jn cv v ab b jo jp jq jr js jt ju jv jw jx jy gk\" >And voila! I imported the spreadsheets for each thread into MaxQDA and ended up with a threaded database of posts to search through and code.</p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "Methods"
            ],
            "date_published": "2020-03-01T11:48:16+01:00",
            "date_modified": "2020-03-01T11:57:39+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/quick-and-dirty-social-media-scrapping.html",
            "url": "https://paddle-cluster.github.io/quick-and-dirty-social-media-scrapping.html",
            "title": "Quick &amp; dirty social media scrapping",
            "summary": "<p data-selectable-paragraph=\"\">This tutorial by <a href=\"https://paddle-cluster.github.io/thomas-hillman.html\">Thomas Hillman</a> describes some basic ways of extracting data from different digital platforms (Flickr, Twitter and Instagram) without needing to code. Being able to code simple scripts to work with social media data is an excellent skill to have, but it is possible to get started with working with trace data without it.</p>\n",
            "content_html": "<p >This tutorial by <a href=\"https://paddle-cluster.github.io/thomas-hillman.html\">Thomas Hillman</a> describes some basic ways of extracting data from different digital platforms (Flickr, Twitter and Instagram) without needing to code. Being able to code simple scripts to work with social media data is an excellent skill to have, but it is possible to get started with working with trace data without it.</p>\n\n<p id=\"8cdd\" >In my work to examine social media use, particularly social photography, I have been faced with the challenge of collecting and managing data from social networks. Very often, accessing a social network through its official web, desktop or mobile apps fails to provide the features necessary for research. This is somewhat obvious since social networks are designed to support use not research of their use. In addition, many social networks, such as Twitter, limit the availability of data through searches to fairly recent time frames. After exploring a number of different approaches for using official and third party interfaces to networks such as Flickr and Instagram, I realized that the best way for me to move forward was to capture as much of the data I wanted as I could from a network and then be free to experiment with different ways of managing and presenting it. Using combinations of adaptations of existing social media scraping tools and my own simple inventions, I have created several home-brew ways of collecting and managing data from social networks.</p>\n<h2 id=\"2329\" class=\"jh ji cn ar aq ef hi jj hk jk jl jm jn jo jp jq jr\"><strong class=\"bu\">Basic approach</strong></h2>\n<p id=\"c417\" class=\"it iu cn ar iv b iw js iy jt ja ju jc jv je jw jg fb\" >My goal with scraping social media is to extract as much relevant data as possible to a format that restricts later processing and analysis as little as possible. To that end, I decided that a simple spreadsheet was probably the best way to store data. Since many social networks restrict the window of data that is accessible, I also decided that a solution which automatically updated without my needing to trigger a process would be best. Based on these criteria, it became evident that a so-called cloud based process would meet my needs. I decided to use the spreadsheet app that is part of Google Drive since it exists in the cloud and effectively runs all the time. For social media scraping, Google spreadsheets has the major advantage that it will populate a spreadsheet based on a feed in such common formats as XML, RSS and JSON, and a script can be written that will cause the feed to be checked automatically at an interval defined by the user. With this key solution that allows data to be constantly fed into a spreadsheet where it can be filtered, organized and stored, the next challenge is to get a specific social network to provide data in the form of a usable stream.</p>\n<p ><img class=\"post__image\" src=\"https://paddle-cluster.github.io/media/posts/40/0FtvBMEN50ojmH4aj.png\" alt=\"\" width=\"792\" height=\"490\"></p>\n<p id=\"62ff\" class=\"it iu cn ar iv b iw ix iy iz ja jb jc jd je jf jg fb\" ><em class=\"kr\">Automatically generated spreadsheet of Flickr images tagged with ‘göteborg naturhistoriska’</em></p>\n<h2 id=\"549a\" class=\"jh ji cn ar aq ef hi jj hk jk jl jm jn jo jp jq jr\"><strong class=\"bu\">Twitter</strong></h2>\n<p id=\"9f13\" class=\"it iu cn ar iv b iw js iy jt ja ju jc jv je jw jg fb\" >Of all the networks I have tried to scrape, Twitter is the one with the most tools available that might be of use to researchers. Several sites such as <a href=\"http://snapbird.org/\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">http://snapbird.org/</a> archive tweets, allowing searches that go back far longer than Twitter’s own 5 day window. I tried these sites but found them cumbersome to use and limited. Instead, I have been using Martin Hawksey’s <a href=\"http://mashe.hawksey.info/2012/01/twitter-archive-tagsv3/\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">Twitter Archiving Google Spreadsheet</a> (TAGS). This set of extensions and scripts for Google Spreadsheet conducts periodic searches of Twitter, archives the results and provides a variety of visualization methods. Using Twitter’s <a href=\"https://support.twitter.com/articles/71577-how-to-use-advanced-twitter-search\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">advanced search operators</a>, it is possible to create a self updating archive for quite complex searches e.g tweet’s mentioning ‘obama’, from within a 5 km radius of Washington DC that contain hyperlinks:</p>\n<p id=\"240d\" class=\"it iu cn ar iv b iw ix iy iz ja jb jc jd je jf jg fb\" ><a href=\"https://twitter.com/search/realtime?q=obama+near%3A+washington+within%3A5km+filter%3Alinks&amp;src=typd\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">https://twitter.com/search/realtime?q=obama+near%3A+washington+within%3A5km+filter%3Alinks&amp;src=typd</a></p>\n<p ><img class=\"post__image\" src=\"https://paddle-cluster.github.io/media/posts/40/0kXE8F_GqoX6pVaKd.png\" alt=\"\" width=\"1024\" height=\"596\"></p>\n<p id=\"2576\" class=\"it iu cn ar iv b iw ix iy iz ja jb jc jd je jf jg fb\" ><em class=\"kr\">Archived tweets mentioning ‘universeum’ visualized through Martin Hawksey’s TAGS Google Spreadsheet extensions</em></p>\n<h2 id=\"b8bc\" class=\"jh ji cn ar aq ef hi jj hk jk jl jm jn jo jp jq jr\"><strong class=\"bu\">Instagram</strong></h2>\n<p id=\"6f47\" class=\"it iu cn ar iv b iw js iy jt ja ju jc jv je jw jg fb\" >For Twitter I was able to find a relatively complete solution for my needs. Instagram, on the other hand, is much newer and required me to combine a variety of web-based service to build a functional solution.</p>\n<p id=\"9929\" class=\"it iu cn ar iv b iw ix iy iz ja jb jc jd je jf jg fb\" >To scrape instagrams based on my own search criteria and automatically archive them I use the following process:</p>\n<p id=\"cac9\" class=\"it iu cn ar iv b iw ix iy iz ja jb jc jd je jf jg fb\" >Create an <a href=\"http://ifttt.com/\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">IFTTT</a> (If This Then That) recipe that searches Instagram for particular keywords at a particular interval, then adds the results as new lines in a Google Spreadsheet. Here is an <a href=\"https://ifttt.com/recipes/75657\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">example recipe</a> that searches Instagram for ‘universeum’ and filters the information provided into columns in a Google Spreadsheet.</p>\n<p id=\"39da\" class=\"it iu cn ar iv b iw ix iy iz ja jb jc jd je jf jg fb\" >To scrape instagrams taken at a specific location, define a geographic search using <a href=\"http://spots.io/\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">spots.io</a>. This tool allows you to specify a location such as a park or museum within a particular city and receive all the instagrams geotagged with the corresponding coordinates. Spots.io provides RSS feeds for searches. This means that it is possible to take the RSS feed for a geo-search and feed it into an IFTTT recipe in the same way as a straight Instagram search. Simply create a recipe that is triggered every time an Instagram is added to the spots.io RSS feed that writes the results to a Google Spreadsheet.</p>\n<p ><img class=\"post__image\" src=\"https://paddle-cluster.github.io/media/posts/40/0UD4n335bIbBz6KKP.png\" alt=\"\" width=\"989\" height=\"758\"></p>\n<p id=\"a326\" class=\"it iu cn ar iv b iw ix iy iz ja jb jc jd je jf jg fb\" ><em class=\"kr\">Results for Instagrams geotagged at Gothenburg Natural History Museum</em></p>\n<h2 id=\"0c6c\" class=\"jh ji cn ar aq ef hi jj hk jk jl jm jn jo jp jq jr\"><strong class=\"bu\">Flickr</strong></h2>\n<p id=\"4030\" class=\"it iu cn ar iv b iw js iy jt ja ju jc jv je jw jg fb\" >To extract information from Flickr I use a similar process to the one I use with Instagram, define a search with Steven DeGraeve’s <a href=\"http://www.degraeve.com/flickr-rss/\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">Flickr RSS Feed Generator</a>. Use the resulting RSS feed to create an IFTTT recipe that filters the data and creates useful columns in a Google Spreadsheet.</p>\n<p ><img class=\"post__image\" src=\"https://paddle-cluster.github.io/media/posts/40/0yro9kl6xNX6Tguqs.png\" alt=\"\" width=\"495\" height=\"539\"></p>\n<p id=\"74c9\" class=\"it iu cn ar iv b iw ix iy iz ja jb jc jd je jf jg fb\" ><em class=\"kr\">Steven DeGraeve’s Flickr RSS Generator</em></p>\n<h2 id=\"f91b\" class=\"jh ji cn ar aq ef hi jj hk jk jl jm jn jo jp jq jr\"><strong class=\"bu\">Other social media</strong></h2>\n<p id=\"1417\" class=\"it iu cn ar iv b iw js iy jt ja ju jc jv je jw jg fb\" >The basic process I outline here is a simple one. It takes advantage of the cloud based nature of Google Spreadsheets to automatically assemble data from social networks. In principle, any information that can be rendered as XML, RSS or JSON can be fed into a spreadsheet. The trick is finding or creating a tool that can produce such a feed. In many cases, feeds can be found that have been created for completely different purposes e.g. DeGraeves Flickr feed generator which was created to make it possible for users to make live updating slideshows from Flickr images. Beyond regular google searches for ways to turn social media into a usable feed, scraping specific resources can be found at <a href=\"https://scraperwiki.com/\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">https://scraperwiki.com/</a> and <a href=\"https://wiki.digitalmethods.net/Dmi/ToolDatabase\" class=\"bo dd ks kt ku kv\" target=\"_blank\" rel=\"noopener nofollow\">https://wiki.digitalmethods.net/Dmi/ToolDatabase</a>.</p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "Methods"
            ],
            "date_published": "2020-03-01T11:42:35+01:00",
            "date_modified": "2020-03-01T11:52:38+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/neil-selwyn-2.html",
            "url": "https://paddle-cluster.github.io/neil-selwyn-2.html",
            "title": "Neil Selwyn",
            "summary": "<p><a href=\"http://der.monash.edu.au/lnm/prof-neil-selwyn/\">Neil Selwyn</a> är professor vid fakulteten för utbildningsvetenskap vid Monash University i Melbourne Australien. Hans forskning och undervisning fokuserar på rollen av digitala medier i vardagen och teknikens (icke) användning i pedagogiska miljöer.</p>\n",
            "content_html": "<p><a href=\"http://der.monash.edu.au/lnm/prof-neil-selwyn/\">Neil Selwyn</a> är professor vid fakulteten för utbildningsvetenskap vid Monash University i Melbourne Australien. Hans forskning och undervisning fokuserar på rollen av digitala medier i vardagen och teknikens (icke) användning i pedagogiska miljöer.</p>\n\n<ul>\n<li><a href=\"https://paddle-cluster.github.io/balanced-2.html\">BalancED</a> (Medforskare)</li>\n</ul>\n<p>Neil har skrivit omfattande om frågor inklusive digital exkludering, utbildnings teknologi policy och studentupplevelsen av teknikbaserat lärande. Han har genomfört forskning om digital teknik, samhälle och utbildning för Australian Research Council (ARC), Economic and Social Research Council (ESRC), British Academy, FORTE, the BBC, Nuffield Foundation, Spencer Foundation, Gates Foundation, Microsoft Partners in Learning, Becta, Australian Government Office of Learning and Teaching (OLT), Australian Communications Consumer Action Network (ACCAN), Rädda barnen, Centrum för distansutbildning, National Assembly of Wales, och olika lokala myndigheter i Storbritannien.</p>\n<p>Neil är en rutinerad huvudtalare på internationella konferenser och en kärnmedlem i gruppen <a href=\"http://der.monash.edu.au/lnm/\">Digital Education Research</a> på Monash. Han producerar också podcasten <a href=\"https://soundcloud.com/eetheducationesearcher\">Meet The Education Researcher</a>.</p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "sv",
                   "Medlemmar"
            ],
            "date_published": "2020-03-01T11:20:32+01:00",
            "date_modified": "2020-03-01T11:26:36+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/neil-selwyn.html",
            "url": "https://paddle-cluster.github.io/neil-selwyn.html",
            "title": "Neil Selwyn",
            "summary": "<p><a href=\"http://der.monash.edu.au/lnm/prof-neil-selwyn/\">Neil Selwyn</a> is a professor in the Faculty of Education, Monash University. His research and teaching focuses on the place of digital media in everyday life, and the sociology of technology (non)use in educational settings.</p>\n",
            "content_html": "<p><a href=\"http://der.monash.edu.au/lnm/prof-neil-selwyn/\">Neil Selwyn</a> is a professor in the Faculty of Education, Monash University. His research and teaching focuses on the place of digital media in everyday life, and the sociology of technology (non)use in educational settings.</p>\n\n<ul>\n<li><a href=\"https://paddle-cluster.github.io/balanced.html\">BalancED</a> (Co-Investigator)</li>\n</ul>\n<div> </div>\n<div>Neil has written extensively on a number of issues, including digital exclusion, education technology policymaking and the student experience of technology-based learning. He has carried out funded research on digital technology, society and education for the Australian Research Council (ARC), Economic and Social Research Council (ESRC), British Academy, the Swedish Research Council for Health, Working Life and Welfare (FORTE)<strong>, </strong>the BBC, Nuffield Foundation, the Spencer Foundation, Gates Foundation, Microsoft Partners in Learning, Becta, Australian Government Office of Learning and Teaching (OLT), <span class=\"st\">Australian Communications Consumer Action Network (ACCAN), Save The Children, </span>Centre for Distance Education, the Welsh Office, National Assembly of Wales and various local authorities in the UK.</div>\n<div> </div>\n<div>Neil is a regular keynote speaker at international conferences and a core member of the '<a href=\"http://der.monash.edu.au/lnm/\" target=\"_blank\" rel=\"noopener\">Digital Education Research</a>' group within Monash. He also produces the '<a href=\"https://soundcloud.com/eetheducationesearcher\" target=\"_blank\" rel=\"noopener\">Meet The Education Researcher</a>' podcast - exploring the latest ideas from across the world of education research</div>\n<p> </p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "en",
                   "Members"
            ],
            "date_published": "2020-03-01T11:14:31+01:00",
            "date_modified": "2020-03-01T11:19:54+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/socdex-2.html",
            "url": "https://paddle-cluster.github.io/socdex-2.html",
            "title": "SOCDEX",
            "summary": "<p class=\"p1\">Syftet med detta projekt är att förstå hur nätverkssamhällen bidrar till expertisutveckling med inriktning på personer som engagerar sig med online sociala plattformar för att utveckla sin kompetens och kunskap om programmering. Projektet är aktuellt med tanke på både sitt intresse för de sociala dimensioner av expertisutveckling i förhållande till onlinemiljöer och dess intresse för livslångt lärande inom programmering.</p>\n",
            "content_html": "<p class=\"p1\">Syftet med detta projekt är att förstå hur nätverkssamhällen bidrar till expertisutveckling med inriktning på personer som engagerar sig med online sociala plattformar för att utveckla sin kompetens och kunskap om programmering. Projektet är aktuellt med tanke på både sitt intresse för de sociala dimensioner av expertisutveckling i förhållande till onlinemiljöer och dess intresse för livslångt lärande inom programmering.</p>\n\n<p class=\"p1\">Kompetens och utveckling i programmering och andra områden har traditionellt studerats på individnivå genom att till exempel jämföra nybörjare med experter när det gäller deras kunskaps- och resonemangsstrategier. Forskare har dock nyligen börjat intressera sig för de sociala dimensionerna av expertis. Att studera expertisutveckling i sitt sociala sammanhang är särskilt relevant för programmering där mjukvaruutvecklingsprojekt ofta är samarbeten mellan många individer som arbetar med gemensam problemlösning.</p>\n<p class=\"p1\">Studier har visat att personer med hög programmeringsexpertis ofta uppvisar stark kommunikations- och samarbetsförmåga samt drar nytta av sina personliga nätverk. Som ett sätt att skapa ett personligt nätverk har många som är intresserade av programmering börjat delta i onlinemiljöer, som till exempel Stack Overflow där miljontals medlemmar samarbetar för att lösa problem. I sådana onlinemiljöer utvecklar programmerare sina programmeringskunskaper och skapar gemenskap kring sitt intresse. Därför är det intressant att studera utvecklingen av programmeringsexpertis ur ett socialt perspektiv genom att undersöka de nätverk som hittills förbisetts i forskningen om expertisutveckling.</p>\n<p class=\"p1\">Tre huvudforskningsfrågor undersöks:</p>\n<ol>\n<li>Vilket kunskapsutbyte finns i en online programmeringsgrupp?</li>\n<li>Hur kan expertstatus i en online programmeringsgrupp erkännas och spåras genom nätverksinteraktioner?</li>\n<li>Vilken roll spelar sociala gemenskapen i en online programmeringsgrupp för expertisutveckling?</li>\n</ol>\n<p>Dessa frågor undersöks genom insamling och analys av fem olika empiri som är inriktade på det populära Stack Overflow-nätverket. Expertisutvecklingen undersöks genom analys av online-interaktioner, en enkät och intervjuer.</p>\n<p class=\"p1\">Projektet bidrar till detta allt viktigare område genom att undersöka hur expertis delas, erkänns och utvecklas i onlinemiljöer i relation till den aktuella frågan om livslångt lärande i programmering. Resultaten kommer att ha praktiska konsekvenser för att stödja inlärning av programmering och mer generellt hur onlinegrupper kan användas för att främja och sprida expertis.</p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "sv",
                   "Projekt"
            ],
            "date_published": "2020-02-22T09:56:42+01:00",
            "date_modified": "2020-02-22T10:08:56+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/tanya-osborne-2.html",
            "url": "https://paddle-cluster.github.io/tanya-osborne-2.html",
            "title": "Tanya Osborne",
            "summary": "<p><a href=\"https://ipkl.gu.se/om-ipkl/personal?userId=xosbta\">Tanya Osborne</a> är doktorand på Institutionen för pedagogik, kommunikation och lärande på Göteborgs universitet..</p>\n",
            "content_html": "<p><a href=\"https://ipkl.gu.se/om-ipkl/personal?userId=xosbta\">Tanya Osborne</a> är doktorand på Institutionen för pedagogik, kommunikation och lärande på Göteborgs universitet..</p>\n\n<ul>\n<li><a href=\"https://paddle-cluster.github.io/socdex-2.html\">SOCDEX</a> (Doktorand)</li>\n<li><a href=\"https://paddle-cluster.github.io/balanced-2.html\">BalancED</a> (Doktorand)</li>\n</ul>\n<p><img class=\"post__image post__image--center\" src=\"https://paddle-cluster.github.io/media/posts/36/Tanya.jpg\" alt=\"\" width=\"210\" height=\"280\"></p>\n<p> </p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "sv",
                   "Medlemmar"
            ],
            "date_published": "2020-02-22T09:56:42+01:00",
            "date_modified": "2020-02-22T11:47:05+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/alena-seredko-2.html",
            "url": "https://paddle-cluster.github.io/alena-seredko-2.html",
            "title": "Alena Seredko",
            "summary": "<p><a href=\"https://ipkl.gu.se/om-ipkl/personal?userId=xseral\">Alena Seredko</a> är doktorand på Institutionen för pedagogik, kommunikation och lärande på Göteborgs universitet.</p>\n",
            "content_html": "<p><a href=\"https://ipkl.gu.se/om-ipkl/personal?userId=xseral\">Alena Seredko</a> är doktorand på Institutionen för pedagogik, kommunikation och lärande på Göteborgs universitet.</p>\n\n<ul>\n<li><a href=\"https://paddle-cluster.github.io/socdex.html\">SOCDEX</a> (Doktorand)</li>\n</ul>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "sv",
                   "Medlemmar"
            ],
            "date_published": "2020-02-22T09:56:42+01:00",
            "date_modified": "2020-02-22T11:47:44+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/svea-kiesewetter-2.html",
            "url": "https://paddle-cluster.github.io/svea-kiesewetter-2.html",
            "title": "Svea Kiesewetter",
            "summary": "<p><a href=\"https://ait.gu.se/english/about-us/division-of-learning--communication-and-it/staff?languageId=100001&amp;userId=xkiesv\">Svea </a><a href=\"https://ait.gu.se/om-institutionen/avdelningen-for-larande--kommunikation-och-it/personal?userId=xkiesv\">Kiesewetter</a> är doktorand på Institutionen för Tillämpad IT på Göteborgs universitet.</p>\n",
            "content_html": "<p><a href=\"https://ait.gu.se/english/about-us/division-of-learning--communication-and-it/staff?languageId=100001&amp;userId=xkiesv\">Svea </a><a href=\"https://ait.gu.se/om-institutionen/avdelningen-for-larande--kommunikation-och-it/personal?userId=xkiesv\">Kiesewetter</a> är doktorand på Institutionen för Tillämpad IT på Göteborgs universitet.</p>\n\n<ul>\n<li><a href=\"https://paddle-cluster.github.io/balanced-2.html\">BalancED</a> (Doktorand)</li>\n<li><a href=\"https://paddle-cluster.github.io/red-2.html\">RED</a> (Doktorand)</li>\n</ul>\n<p><img class=\"post__image post__image--center\" src=\"https://paddle-cluster.github.io/media/posts/34/Svea-K-new.png\" alt=\"\" width=\"187\" height=\"280\"></p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "sv",
                   "Medlemmar"
            ],
            "date_published": "2020-02-22T09:56:42+01:00",
            "date_modified": "2020-02-22T11:43:23+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/mona-lundin-2.html",
            "url": "https://paddle-cluster.github.io/mona-lundin-2.html",
            "title": "Mona Lundin",
            "summary": "<p><a href=\"https://ipkl.gu.se/om-ipkl/personal?userId=xnimon\">Mona Lundin</a> är docent på Institutionen för pedagogik, kommunikation och lärande på Göteborgs universitet. Hennes övergripande forskningsintresse rör kommunikation, lärande och digitala medier i fortbildning och professionella verksamheter. Jag disputerade 2009 på avhandlingen: 'Food for Thought: Communication and the transformation of work experience in web-based in-service training'.</p>\n",
            "content_html": "<p><a href=\"https://ipkl.gu.se/om-ipkl/personal?userId=xnimon\">Mona Lundin</a> är docent på Institutionen för pedagogik, kommunikation och lärande på Göteborgs universitet. Hennes övergripande forskningsintresse rör kommunikation, lärande och digitala medier i fortbildning och professionella verksamheter. Jag disputerade 2009 på avhandlingen: 'Food for Thought: Communication and the transformation of work experience in web-based in-service training'.</p>\n\n<ul>\n<li><a href=\"https://paddle-cluster.github.io/balanced-2.html\">BalancED</a> (Medforskare)</li>\n<li><a href=\"https://paddle-cluster.github.io/socdex-2.html\">SOCDEX</a> (Doktorand handledare)</li>\n</ul>\n<p><img class=\"post__image post__image--center\" style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://paddle-cluster.github.io/media/posts/33/1283094_mona-nilsen-068A.jpg\" alt=\"\" width=\"187\" height=\"280\"></p>\n<p> </p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "sv",
                   "Medlemmar"
            ],
            "date_published": "2020-02-22T09:56:42+01:00",
            "date_modified": "2020-02-22T11:41:14+01:00"
        },
        {
            "id": "https://paddle-cluster.github.io/catarina-player-koro-2.html",
            "url": "https://paddle-cluster.github.io/catarina-player-koro-2.html",
            "title": "Catarina Player-Koro",
            "summary": "<p><a href=\"https://idpp.gu.se/english/about-idpp/staff/?languageId=100001&amp;disableRedirect=true&amp;returnUrl=http%3A%2F%2Fidpp.gu.se%2Fom-idpp%2Fpersonal%2F%3FlanguageId%3D100000%26userId%3Dxplaca&amp;userId=xplaca\">Catarina Player-Koro</a> is Associate Professor at the Department of Pedagogical, Curricular and Professional Studies at the University of Gothenburg. Her main research interest includes critical sociological studies of educational technology and educational policy studies, with a special interest in teachers work and teacher education.</p>\n",
            "content_html": "<p><a href=\"https://idpp.gu.se/english/about-idpp/staff/?languageId=100001&amp;disableRedirect=true&amp;returnUrl=http%3A%2F%2Fidpp.gu.se%2Fom-idpp%2Fpersonal%2F%3FlanguageId%3D100000%26userId%3Dxplaca&amp;userId=xplaca\">Catarina Player-Koro</a> is Associate Professor at the Department of Pedagogical, Curricular and Professional Studies at the University of Gothenburg. Her main research interest includes critical sociological studies of educational technology and educational policy studies, with a special interest in teachers work and teacher education.</p>\n\n<ul>\n<li><a href=\"https://paddle-cluster.github.io/balanced-2.html\">BalancED</a> (Medforskare)</li>\n</ul>\n<p><img class=\"post__image post__image--center\" style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://paddle-cluster.github.io/media/posts/32/_MG_1210a1.jpg\" alt=\"\" width=\"246\" height=\"280\"></p>\n<p>C<span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">atarina is currently active in research in the policy fields in studies on policy network formations, connecting public and commercial interests and actors within IT education policy an in investigating the policy effects of the implementation of career pathways for teachers, in Swedish schools.</span></p>",
            "author": {
                "name": "Thomas Hillman"
            },
            "tags": [
                   "sv",
                   "Medlemmar"
            ],
            "date_published": "2020-02-22T09:56:42+01:00",
            "date_modified": "2020-02-22T11:37:41+01:00"
        }
    ]
}
